In [ ]:
Q1. List any five functions of the pandas library with execution.

In [10]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')
print(df.head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

In [11]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [12]:
df[['Name','Sex','Ticket','Cabin','Embarked']]

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,211536,NaN,S
887,"Graham, Miss. Margaret Edith",female,112053,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,W./C. 6607,NaN,S
889,"Behr, Mr. Karl Howell",male,111369,C148,C
890,"Dooley, Mr. Patrick",male,370376,NaN,Q

In [16]:
type(df)

pandas.core.frame.DataFrame

In [17]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [18]:
df.dtypes=='objects'

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age            False
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin          False
Embarked       False
dtype: bool

In [ ]:
Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [19]:
def reindex_with_increment(df):
    
    new_index = pd.RangeIndex(start=1, stop=len(df) * 2, step=2)

    
    df_reindexed = df.set_index(new_index)

    return df_reindexed

data = {
    'A': [10, 20, 30, 40, 50],
    'B': [100, 200, 300, 400, 500],
    'C': [1000, 2000, 3000, 4000, 5000]
}

df = pd.DataFrame(data)
df_reindexed = reindex_with_increment(df)
print(df_reindexed)

    A    B     C
1  10  100  1000
3  20  200  2000
5  30  300  3000
7  40  400  4000
9  50  500  5000

In [ ]:
Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [20]:
def sum_first_three_values(df):
    
    total_sum = 0

    
    for index, row in df.head(3).iterrows():
        total_sum += row['Values']

    
    print("Sum of the first three values:", total_sum)

data = {
    'Values': [10, 20, 30, 40, 50]
}

df = pd.DataFrame(data)


sum_first_three_values(df)

Sum of the first three values: 60

In [ ]:
Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [21]:
def count_words_in_text(df):
    
    def word_count(text):
        return len(text.split())

    
    df['Word_Count'] = df['Text'].apply(word_count)

    return df


data = {
    'Text': ["This is a sample text.", "Pandas is great for data analysis.", "Python is a powerful language."]
}

df = pd.DataFrame(data)


df_with_word_count = count_words_in_text(df)


print(df_with_word_count)

                                 Text  Word_Count
0              This is a sample text.           5
1  Pandas is great for data analysis.           6
2      Python is a powerful language.           5

In [ ]:
Q5. How are DataFrame.size() and DataFrame.shape() different?

In [ ]:
DataFrame.size:-
               It represents the product of the number of rows and the number of columns in the DataFrame.
DataFrame.shape:-
This attribute gives a tuple representing the dimensions of the DataFrame. It returns a tuple in the form 
 (number of rows, number of columns).

In [ ]:
Q6. Which function of pandas do we use to read an excel file?

In [ ]:
read_excel()

In [ ]:
Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [22]:
def extract_username(df):
    
    df['Username'] = df['Email'].str.split('@').str[0]

    return df
data = {
    'Email': ['john.doe@example.com', 'jane.smith@example.com', 'bob.johnson@example.com']
}

df = pd.DataFrame(data)


df_with_username = extract_username(df)
print(df_with_username)

                     Email     Username
0     john.doe@example.com     john.doe
1   jane.smith@example.com   jane.smith
2  bob.johnson@example.com  bob.johnson

In [ ]:
Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

Your function should select the following rows: A B C
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows.

In [23]:
def select_rows(df):
    
    selected_rows = df[(df['A'] > 5) & (df['B'] < 10)]

    return selected_rows


data = {
    'A': [3, 8, 6, 2, 9],
    'B': [5, 2, 9, 3, 1],
    'C': [1, 7, 4, 5, 2]
}

df = pd.DataFrame(data)


selected_df = select_rows(df)
print(selected_df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [ ]:
Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [24]:
def calculate_statistics(df):
    
    mean_value = df['Values'].mean()
    median_value = df['Values'].median()
    std_deviation = df['Values'].std()

    return mean_value, median_value, std_deviation


data = {
    'Values': [10, 20, 30, 40, 50]
}

df = pd.DataFrame(data)


mean, median, std_dev = calculate_statistics(df)


print("Mean:", mean)
print("Median:", median)
print("Standard Deviation:", std_dev)

Mean: 30.0
Median: 30.0
Standard Deviation: 15.811388300841896

In [ ]:
Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [25]:
def calculate_moving_average(df):
    
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()

    return df


data = {
    'Date': pd.date_range(start='2023-07-01', periods=10),
    'Sales': [100, 200, 300, 400, 500, 600, 700, 800, 900, 1000]
}

df = pd.DataFrame(data)


df_with_moving_average = calculate_moving_average(df)


print(df_with_moving_average)

        Date  Sales  MovingAverage
0 2023-07-01    100          100.0
1 2023-07-02    200          150.0
2 2023-07-03    300          200.0
3 2023-07-04    400          250.0
4 2023-07-05    500          300.0
5 2023-07-06    600          350.0
6 2023-07-07    700          400.0
7 2023-07-08    800          500.0
8 2023-07-09    900          600.0
9 2023-07-10   1000          700.0

In [ ]:
Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [26]:
def add_weekday_column(df):
    
    df['Date'] = pd.to_datetime(df['Date'])

    
    df['Weekday'] = df['Date'].dt.strftime('%A')

    return df


data = {
    'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']
}

df = pd.DataFrame(data)


df_with_weekday = add_weekday_column(df)


print(df_with_weekday)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

In [ ]:
Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [27]:
def select_rows_between_dates(df, start_date, end_date):
    
    df['Date'] = pd.to_datetime(df['Date'])

    
    selected_rows = df[(df['Date'] >= start_date) & (df['Date'] <= end_date)]

    return selected_rows


data = {
    'Date': ['2023-01-01', '2023-01-15', '2023-01-25', '2023-02-10', '2023-02-20']
}

df = pd.DataFrame(data)


start_date = '2023-01-01'
end_date = '2023-01-31'
selected_df = select_rows_between_dates(df, start_date, end_date)


print(selected_df)

        Date
0 2023-01-01
1 2023-01-15
2 2023-01-25

In [ ]:
Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

In [ ]:
To use the basic functions of pandas, the first and foremost library that needs to be imported is pandas itself. 
import pandas as pd